Twist/Twist-TAS/servicerequestfiles/activateService.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ser="http://b2b.tracfone.com/ServiceActivation" xmlns:com="http://www.tracfone.com/CommonTypes" xmlns:phon="http://www.tracfone.com/PhoneCommonTypes" xmlns:pay="http://www.tracfone.com/PaymentCommonTypes" xmlns:sec="http://www.tracfone.com/SecurityCommonTypes" xmlns:acc="http://www.tracfone.com/AccountCommonTypes">
   <soapenv:Header xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
      <wsse:Security soap:mustUnderstand="1" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
         <wsse:UsernameToken wsu:Id="unt_dymtpxyv7NS1BCB4" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
            <wsse:Username>@secusername</wsse:Username>
            <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">@secpassword</wsse:Password>
         </wsse:UsernameToken>
      </wsse:Security>
   </soapenv:Header>
   <soapenv:Body>
      <ser:activateServiceRequest>
         <com:requestToken>
            <com:clientTransactionId>23234</com:clientTransactionId>
            <com:clientId>2342</com:clientId>
         </com:requestToken>
         <com:brandName>ANY</com:brandName>
         <com:sourceSystem>SMS</com:sourceSystem>
         <com:language>ENG</com:language>
         <ser:pin>@pin</ser:pin>
         <ser:deviceId>
            <phon:min>@min</phon:min>
         </ser:deviceId>
      </ser:activateServiceRequest>
   </soapenv:Body>
</soapenv:Envelope>
